# ElementArray Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ElementArray Class
Members See Also
---
An array that contains element objects.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class ElementArray : APIObject,
	IEnumerable
```

Visual Basic
---
```text
Public Class ElementArray _
	Inherits APIObject _
	Implements IEnumerable
```

Visual C++
---
```text
public ref class ElementArray : public APIObject,
	IEnumerable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..APIObject Autodesk.Revit.DB..::..ElementArray
# See Also
ElementArray Members
Autodesk.Revit.DB Namespace